tests/Integration/Request/data/refundCreatedResponse.json

{
    "orderId":"ZXWZ53KQQM200702GUEST000P01",
    "refund":{
        "refundId":"5000009987",
        "extRefundId":"20200702091903",
        "amount":"21000",
        "currencyCode":"PLN",
        "description":"Uznanie 5000009987 Refund",
        "creationDateTime":"2020-07-02T09:19:03.896+02:00",
        "status":"PENDING",
        "statusDateTime":"2020-07-02T09:19:04.013+02:00"
    },
    "status":{
        "statusCode":"SUCCESS",
        "statusDesc":"Refund queued for processing"
    }
}
